//package org.example;
//// 문제 - 사람이 a왼팔 이라는 변수를 가질 수 있게 해주세요.
//// 문제 : 아래가 실행되도록 해주세요.
//class Main {
//    public static void main(String[] args) {
//        사람 a사람 = new 사람();
//
//        a사람.나이 = 20;
//        // 위 문장이 실행되려면 사람 클래스 안에 20(정수형)이 들어갈 필드가 있어야 한다.
//        a사람.a왼팔 = new 팔();
//        // 위 문장이 실행되려면 사람 클래스 안에 팔();이 들어갈 필드가 있어야 한다.
//        a사람.a왼팔.길이 = 20;
//    }
//}
//
//class 사람 {
//    // 클래스안에 변수를 정의 할 수 있다.
//    int 나이;
//    팔 a왼팔;
//}
//
//class 팔 {
//    int 길이; // 사람에서 팔을 거쳐 접근 가능
//}